posts/python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing.org
#+BEGIN_COMMENT
.. title: python 基础一：基础语法和解释运行
.. slug: python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing
.. date: 2020-02-09 17:07:45 UTC+08:00
.. tags: python 
.. category: python
.. link: 
.. description: 
.. type: text
#+END_COMMENT
#+OPTIONS: \n:t

#+BEGIN_EXPORT md
<h1 align="center"><font color="0066FF" size=110%>A notebook from org-mode</font></h1>
#+END_EXPORT

#+begin_src ipython :session python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing  :exports none
  %matplotlib inline
  import matplotlib.pyplot as plt
  import numpy as np
#+end_src

#+RESULTS:
: # Out[1]:

* 认识python
***  python是解释执行的动态语言

python一般是运行解释器解析python文件（模块）来运行，或者可以通过调用（python -i）进行交互式开发（边写代码，边运行，是不是很酷？）

作为初学者，可以先通过“pip install ipython”安装ipython，然后通过调用“ipython”来启动交互界面，ipython是python交互式开发的增强工具，提供了自动补全，语法高亮的功能，可以更好的进行更好的进行交互式开发。

后面大部分提供的代码示例都可以放到ipython里演示。

{{{TEASER_END}}}

*** 语法简洁，优美，工程简单

1. python没有大多数语言的“;”语句分割符号，依靠缩进来规范语句段落间隔，同时因为python大量的内置函数，支持函数式和面向对象编程范式，语法非常精简，良好规范后的python的代码简洁优美。后面会介绍如何使用flake8工具来规范代码。

2. 简单的python程序可以是单个文件，也可以是一个python包（模块， 后面会介绍python的包管理），
所以很多运维工程师和自动化测试工程师会选择python作为任务脚本语言，一个文件就是一个完整的程序，结构简单。

*** python和CPython

python是一种语言规范，Cpython是基于c语言实现的一个现实版本，多数情况下我们说的python其实是CPYthon，除了cpython还有其他的实现版本，
如：JPython（java）， RPython(R语言), PyPython（这个有意思是基于python语言的自实现版本）...

  
*** 功能扩展库多，应用广泛

因为多数情况我们用的是CPython（目前的系统级底层大部分都是基于c、c++的），所以除了纯python实现的三方库以外，
还有很多基于其他的语言实现库，所以python应用范围很广。例如：基于pytest可以做一些简单的自动化测试工作，
pyqt、wxwidget做简单的gui程序，还有目前热门的大数据、AI方面也是很多人的主要开发语言。
  

*** python2.x & python 3.x

目前python有python2.x和python3.x两个流行的版本，python3是在python2的基础上，做了一些语法的优化，和加入了一些新的特性和优化。
由于python2在2020年官方就不再支持安全更新了，所以现在学习python3就可以了，
两者的大部分的语法都是一致的，对于差异，在学习和工作中稍作留意即可。

一般类unix系统（linux、mac os）都自带python，但是不一定默认是python3，可以在终端执行'python --version',查看当前版本是否是python3版本。
如果不是python3或者没有安装python，可以从[[https:www.python.org/downloads/][python org]]下载安装包安装。

安装完python后，通常还必须[[https:pip.pypa.io/en/stable/installing/][安装pip python包管理工具]]，用来安装其他三方库。

*** 开发工具

pycharm，VSCode(强烈推荐),IPython, vim, emacs,等等。

*** 检查环境

很多时候需要管理多个python环境，如果你对你的运行、安装环境有疑问，可以运行一下代码检查一下
\\

#+BEGIN_SRC ipython :session python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing :exports both :results raw drawer

import sys

print("sys.path 包含了当前pythonpath路径，也就是python寻找包的路径列表")

for p in sys.path:
    print(p)

#+END_SRC

#+RESULTS:
:results:
# Out[4]:
sys.path 包含了当前pythonpath路径，也就是python寻找包的路径列表
/Users/vincent/anaconda3/envs/python36/lib/python36.zip
/Users/vincent/anaconda3/envs/python36/lib/python3.6
/Users/vincent/anaconda3/envs/python36/lib/python3.6/lib-dynload
\\                              
/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages
/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages/IPython/extensions
/Users/vincent/.ipython 
:end:

\\
可以看到上面的路径顺序，中间的空格表示当前目录，所以三方包（通过pip install安装或者python setup.py instal·l安装的包，
一般都会安装到site-packages目录下）优先级是比当前工作目录下的python模块优先级低，如果本地模块和三方包有同名的情况，会优先import本地的。


* 基础语法
*** 模块名、文件名

python的模块可以是一个文件也可以是一个包或者目录，模块名不能包含“.”（除了".py"后缀）符号。如果是目录的话，目录中必须包含"____init____.py"文件，才会被python识别为模块，从而被“import”。

"import"包时使用显式引入包名，不要使用"*",后者会降低代码可读性，也可能导致一些冲突。

如，下面的显示引入包名：
#+BEGIN_SRC ipython :session python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing :exports both :results raw drawer

from math import sqrt

print(sqrt(3))

#+END_SRC

#+RESULTS:
:results:
# Out[2]:
1.7320508075688772
:end:

明显比下面的代码可读性更强，同时也可以避免一些同名模块或变量的歧义，冲突。

#+BEGIN_SRC ipython :session python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing :exports both :results raw drawer

from math import *

print(sqrt(3))

#+END_SRC

#+RESULTS:
:results:
# Out[6]:
1.7320508075688772
:end:

**** python3 的模块引入规范

只有模块名在全局路路径（sys.path）中才可以直接"import",否则需要使用相对路径"import"。

#+BEGIN_SRC ipython :session python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing :exports both :results raw drawer

  import math # ok , 因为math在sys.path所有路径中有包含
  from . import your_own_mod  # ok，相对路径
  import your_own_mod # 如果your_own_mod是在当前运行环境目录中，正确，否则会报错误

#+END_SRC


*** 变量

python是动态语言，变量无需声明，可以直接定义、赋值。所以变量的类型也是动态类型,并且运行过程中同一个变量可以有不同的值甚至不同的类型。
所以在python程序中，如果你的程序是由多个文件、模块构成的，应该尽量避免使用全局变量。
 
#+BEGIN_SRC ipython :session python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing :exports both :results raw drawer

a = "hello world"

print("a is ", a)

a = 0
print("a is ", a)

#+END_SRC

#+RESULTS:
:results:
# Out[3]:
a is  hello world
a is  0
:end:


