posts/python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing/index.html
<!DOCTYPE html>
<html prefix="
og: http://ogp.me/ns#
article: http://ogp.me/ns/article#
" lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>python 基础一：基础语法和解释运行 | vincent blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://wisonwang.github.io/posts/python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="vincent wang">
<meta property="og:site_name" content="vincent blog">
<meta property="og:title" content="python 基础一：基础语法和解释运行">
<meta property="og:url" content="https://wisonwang.github.io/posts/python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing/">
<meta property="og:description" content="认识python



python是解释执行的动态语言


python一般是运行解释器解析python文件（模块）来运行，或者可以通过调用（python -i）进行交互式开发（边写代码，边运行，是不是很酷？）



作为初学者，可以先通过“pip install ipython”安装ipython，然后通过调用“ipython”来启动交互界面，ipython是python交互式开发的增强工具，">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-02-09T17:07:45+08:00">
<meta property="article:tag" content="python">
</head>
<body>
    <section class="social"><ul>
<li><a href="../../index.html" title="Home"><i class="icon-home"></i></a></li>
            <li><a href="../../archive.html" title="文章存档"><i class="icon-archive"></i></a></li>
            <li><a href="../../categories/" title="标签"><i class="icon-tags"></i></a></li>
            <li><a href="../../pages/about" title="About"><i class="icon-about"></i></a></li>
            <li><a href="../../rss.xml" title="RSS 源"><i class="icon-rss"></i></a></li>
            <li><a href="https://twitter.com/wisonwang" title="My Twitter"><i class="icon-twitter"></i></a></li>
            <li><a href="https://github.com/wisonwang" title="My Github"><i class="icon-github"></i></a></li>

        </ul></section><section class="page-content"><div class="content" rel="main">
    <div class="post">
        <h1 class="p-name entry-title" itemprop="headline name">python 基础一：基础语法和解释运行</h1>

        <div class="meta">
            <div class="authordate">
                <time class="timeago" datetime="2020-02-09T17:07:45+08:00">2020-02-09 17:07</time>
            
                      |  
        <a href="index.org" id="sourcelink">源代码</a>

            </div>
                    <div itemprop="keywords" class="tags">
        <ul>
        标签 : 
           <li><a class="tag p-category" href="../../categories/python/" rel="tag">python</a></li>
        </ul>
</div>

        </div>
        <div class="body">
            <div id="outline-container-org319673c" class="outline-2">
<h2 id="org319673c">认识python</h2>
<div class="outline-text-2" id="text-org319673c">
</div>
<div id="outline-container-orgd78390c" class="outline-4">
<h4 id="orgd78390c">python是解释执行的动态语言</h4>
<div class="outline-text-4" id="text-orgd78390c">
<p>
python一般是运行解释器解析python文件（模块）来运行，或者可以通过调用（python -i）进行交互式开发（边写代码，边运行，是不是很酷？）<br></p>

<p>
作为初学者，可以先通过“pip install ipython”安装ipython，然后通过调用“ipython”来启动交互界面，ipython是python交互式开发的增强工具，提供了自动补全，语法高亮的功能，可以更好的进行更好的进行交互式开发。<br></p>

<p>
后面大部分提供的代码示例都可以放到ipython里演示。<br></p>

<!-- TEASER_END -->
</div>
</div>

<div id="outline-container-org35deec8" class="outline-4">
<h4 id="org35deec8">语法简洁，优美，工程简单</h4>
<div class="outline-text-4" id="text-org35deec8">
<ol class="org-ol">
<li>python没有大多数语言的“;”语句分割符号，依靠缩进来规范语句段落间隔，同时因为python大量的内置函数，支持函数式和面向对象编程范式，语法非常精简，良好规范后的python的代码简洁优美。后面会介绍如何使用flake8工具来规范代码。<br>
</li>

<li>简单的python程序可以是单个文件，也可以是一个python包（模块， 后面会介绍python的包管理），<br>
</li>
</ol>
<p>
所以很多运维工程师和自动化测试工程师会选择python作为任务脚本语言，一个文件就是一个完整的程序，结构简单。<br></p>
</div>
</div>

<div id="outline-container-org70b0d8c" class="outline-4">
<h4 id="org70b0d8c">python和CPython</h4>
<div class="outline-text-4" id="text-org70b0d8c">
<p>
python是一种语言规范，Cpython是基于c语言实现的一个现实版本，多数情况下我们说的python其实是CPYthon，除了cpython还有其他的实现版本，<br>
如：JPython（java）， RPython(R语言), PyPython（这个有意思是基于python语言的自实现版本）…<br></p>
</div>
</div>


<div id="outline-container-org6f4784c" class="outline-4">
<h4 id="org6f4784c">功能扩展库多，应用广泛</h4>
<div class="outline-text-4" id="text-org6f4784c">
<p>
因为多数情况我们用的是CPython（目前的系统级底层大部分都是基于c、c++的），所以除了纯python实现的三方库以外，<br>
还有很多基于其他的语言实现库，所以python应用范围很广。例如：基于pytest可以做一些简单的自动化测试工作，<br>
pyqt、wxwidget做简单的gui程序，还有目前热门的大数据、AI方面也是很多人的主要开发语言。<br></p>
</div>
</div>


<div id="outline-container-org2c3059b" class="outline-4">
<h4 id="org2c3059b">python2.x &amp; python 3.x</h4>
<div class="outline-text-4" id="text-org2c3059b">
<p>
目前python有python2.x和python3.x两个流行的版本，python3是在python2的基础上，做了一些语法的优化，和加入了一些新的特性和优化。<br>
由于python2在2020年官方就不再支持安全更新了，所以现在学习python3就可以了，<br>
两者的大部分的语法都是一致的，对于差异，在学习和工作中稍作留意即可。<br></p>

<p>
一般类unix系统（linux、mac os）都自带python，但是不一定默认是python3，可以在终端执行'python –version',查看当前版本是否是python3版本。<br>
如果不是python3或者没有安装python，可以从<a href="https:www.python.org/downloads/">python org</a>下载安装包安装。<br></p>

<p>
安装完python后，通常还必须<a href="https:pip.pypa.io/en/stable/installing/">安装pip python包管理工具</a>，用来安装其他三方库。<br></p>
</div>
</div>

<div id="outline-container-org47b36d0" class="outline-4">
<h4 id="org47b36d0">开发工具</h4>
<div class="outline-text-4" id="text-org47b36d0">
<p>
pycharm，VSCode(强烈推荐),IPython, vim, emacs,等等。<br></p>
</div>
</div>

<div id="outline-container-org71203a5" class="outline-4">
<h4 id="org71203a5">检查环境</h4>
<div class="outline-text-4" id="text-org71203a5">
<p>
很多时候需要管理多个python环境，如果你对你的运行、安装环境有疑问，可以运行一下代码检查一下<br></p>


<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">sys</span>

<span class="nb">print</span><span class="p">(</span><span class="s2">"sys.path 包含了当前pythonpath路径，也就是python寻找包的路径列表"</span><span class="p">)</span>

<span class="k">for</span> <span class="n">p</span> <span class="ow">in</span> <span class="n">sys</span><span class="o">.</span><span class="n">path</span><span class="p">:</span>
    <span class="nb">print</span><span class="p">(</span><span class="n">p</span><span class="p">)</span>
</pre></div>

<pre class="example">
sys.path 包含了当前pythonpath路径，也就是python寻找包的路径列表
/Users/vincent/anaconda3/envs/python36/lib/python36.zip
/Users/vincent/anaconda3/envs/python36/lib/python3.6
/Users/vincent/anaconda3/envs/python36/lib/python3.6/lib-dynload

/Users/vincent/anaconda3/envs/python36/lib/python3.6/site-packages
...

</pre>

<p>
可以看到上面的路径顺序，中间的空格表示当前目录，所以三方包（通过pip install安装或者python setup.py instal·l安装的包，<br>
一般都会安装到site-packages目录下）优先级是比当前工作目录下的python模块优先级低，如果本地模块和三方包有同名的情况，会优先import本地的。<br></p>
</div>
</div>
</div>


<div id="outline-container-org789f493" class="outline-2">
<h2 id="org789f493">基础语法</h2>
<div class="outline-text-2" id="text-org789f493">
</div>
<div id="outline-container-org0c4a4a6" class="outline-4">
<h4 id="org0c4a4a6">模块名、文件名</h4>
<div class="outline-text-4" id="text-org0c4a4a6">
<p>
python的模块可以是一个文件也可以是一个包或者目录，模块名不能包含“.”（除了".py"后缀）符号。如果是目录的话，目录中必须包含"<span class="underline"><span class="underline">__init__</span></span>.py"文件，才会被python识别为模块，从而被“import”。<br></p>

<p>
"import"包时使用显式引入包名，不要使用"*",后者会降低代码可读性，也可能导致一些冲突。<br></p>

<p>
如，下面的显示引入包名：<br></p>

<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">math</span> <span class="kn">import</span> <span class="n">sqrt</span>

<span class="nb">print</span><span class="p">(</span><span class="n">sqrt</span><span class="p">(</span><span class="mi">3</span><span class="p">))</span>
</pre></div>

<pre class="example">
1.7320508075688772

</pre>

<p>
明显比下面的代码可读性更强，同时也可以避免一些同名模块或变量的歧义，冲突。<br></p>

<div class="highlight"><pre><span></span><span class="kn">from</span> <span class="nn">math</span> <span class="kn">import</span> <span class="o">*</span>

<span class="nb">print</span><span class="p">(</span><span class="n">sqrt</span><span class="p">(</span><span class="mi">3</span><span class="p">))</span>
</pre></div>

<pre class="example">
1.7320508075688772

</pre>
<p>
:results:<br>
#+BEGIN_EXAMPLE<br>
1.7320508075688772<br></p>

<p>
#+END<br></p>
</div>

<ul class="org-ul">
<li>
<a id="org5ceb7f2"></a>python3 的模块引入规范<br><div class="outline-text-5" id="text-org5ceb7f2">
<p>
只有模块名在全局路路径（sys.path）中才可以直接"import",否则需要使用相对路径"import"。<br></p>

<div class="highlight"><pre><span></span><span class="kn">import</span> <span class="nn">math</span> <span class="c1"># ok , 因为math在sys.path所有路径中有包含</span>
<span class="kn">from</span> <span class="nn">.</span> <span class="kn">import</span> <span class="n">your_own_mod</span>  <span class="c1"># ok，相对路径</span>
<span class="kn">import</span> <span class="nn">your_own_mod</span> <span class="c1"># 如果your_own_mod是在当前运行环境目录中，正确，否则会报错误</span>
</pre></div>
</div>
</li>
</ul>
</div>


<div id="outline-container-org27085de" class="outline-4">
<h4 id="org27085de">变量</h4>
<div class="outline-text-4" id="text-org27085de">
<p>
python是动态语言，变量无需声明，可以直接定义、赋值。所以变量的类型也是动态类型,并且运行过程中同一个变量可以有不同的值甚至不同的类型。<br>
所以在python程序中，如果你的程序是由多个文件、模块构成的，应该尽量避免使用全局变量。<br></p>

<div class="highlight"><pre><span></span><span class="n">a</span> <span class="o">=</span> <span class="s2">"hello world"</span>

<span class="nb">print</span><span class="p">(</span><span class="s2">"a is "</span><span class="p">,</span> <span class="n">a</span><span class="p">)</span>

<span class="n">a</span> <span class="o">=</span> <span class="mi">0</span>
<span class="nb">print</span><span class="p">(</span><span class="s2">"a is "</span><span class="p">,</span> <span class="n">a</span><span class="p">)</span>
</pre></div>

<p>
a is  hello world<br>
a is  0<br></p>
</div>
</div>
