posts/python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing.org
*** 函数

函数以def定义，python通过空行和缩进来区分函数作用域，函数定义的开始和结束，至少空一行，最好是空两行。语句段落间，推荐空一行，保证程序结构清晰。


#+BEGIN_SRC ipython :session python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing :exports both :results raw drawer


# *args 表示可变参数，**kw表示可变的key参数。是处理未知参数的两种扩展参数
# fname 是普通的站位参数，sname是一个key参数，key参数必须在所有普通参数后面定义，函数调用时同理，但是key参数调用时顺序是可变的
# 例如： echo("vincent", sname="wang", addr="", 1, 2, 3) 错误
# echo("vincent",  1, 2, 3, addr="", sname="wang") 正确
def echo(fname,  *args, sname="", **kw):
	print(fname, sname, args, kw)

echo("vincent", 1, 2, 3, sname="wang", addr="")

#+END_SRC

#+RESULTS:
:results:
# Out[33]:
vincent wang (1, 2, 3) {'addr': ''}
:end:

*** 类&对象

python类型定义使用class 关键字，创建对象类似于函数调用，只是调用者为类。

#+BEGIN_SRC ipython :session python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing :exports both :results raw drawer

class Student(object):
    # 这里定义的定义 会同事定义class和object属性
    fname = "??"
    sname = "????"
    age = 12
    addr = "......"
    phone = "1000000"

    def ____init____(self, fname: str, sname: str, age: int, **kw):
        """初始化方法"""
        self.fname = fname
        self.sname = sname
        # class 属性可以作为默认值
        self.age = kw.get("age", self.age)
        self.phone = kw.get("phone", self.phone)
        self.addr = kw.get("addr", self.addr)
        # sex只是对象的属性，不是class的属性
        self.sex = kw.get("sex", 0)

    def echo(self):
        print(str(self))

    @classmethod
    def echo_class(cls):
        print(cls, cls.fname, cls.sname, cls.age, cls.addr, cls.phone)


    def ____str____(self):
        """当对象转化成字符串时回调用对象的____str____方法"""
        return str({
            "fname": self.fname,
            "sname": self.sname,
            "age": self.age,
            "addr": self.addr,
            "phone": self.phone,
            "sex": self.sex
        })


Student.echo_class()

s1 = Student("vincent", "wang", 32, sex=1)

s1.echo()

Student.addr = "??????xxxx"
Student.echo_class()

s2 = Student("vincent", "wang", 32, sex=1)

# 可以看到s2和s1的addr属性是不一致的，原因是对象在初始化前，首先拷贝的类的属性和值
s2.echo()

#+END_SRC

#+RESULTS:
:results:
# Out[34]:
<class '____main____.Student'> ?? ???? 12 ...... 1000000
{'fname': 'vincent', 'sname': 'wang', 'age': 12, 'addr': '......', 'phone': '1000000', 'sex': 1}
<class '____main____.Student'> ?? ???? 12 ??????xxxx 1000000
{'fname': 'vincent', 'sname': 'wang', 'age': 12, 'addr': '??????xxxx', 'phone': '1000000', 'sex': 1}
:end:

其实在python中类也是一种对象，也是可以在运行时动态创建和修改定义的。
新的python规范中所有的类都是继承object这个根类，所以也自带一些内置的函数和方法。如上个例子中的"____str____"方法。初学者可以稍微浏览一下这些方法，一遍更深入的了解python类和对象的运行机制.

*** 注释

一般单行注释可以使用“#”,多行注释可以使用三个（单、双）引号对包括。

* 数据类型
*** python是面向对象编程的语言,但是也可以像函数式语言工作
\\

python 中所有类型都可以看作类、对象。例如所有的函数都是"第一类"的对象，函数有自己的方法，属性，类型，也可以作为任何函数的参数。

如:

#+BEGIN_SRC ipython :session python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing :exports both :results raw drawer
# 通过type函数打印print函数类型
print(type(print))
# 通过dir函数访问print函数（对象）属性
print(dir(print))

#+END_SRC

#+RESULTS:
:results:
# Out[8]:
['____call____', '____class____', '____delattr____', '____dir____', '____doc____', '____eq____', '____format____', '____ge____', '____getattribute____', '____gt____', '____hash____', '____init____', '____init_subclass____', '____le____', '____lt____', '____module____', '____name____', '____ne____', '____new____', '____qualname____', '____reduce____', '____reduce_ex____', '____repr____', '____self____', '____setattr____', '____sizeof____', '____str____', '____subclasshook____', '____text_signature____'] <class 'builtin_function_or_method'>
:end:

可以看到print函数类型是“class 'builtin_function_or_method'”类， 以及它的属性和方法。


虽然python所有类型都是类和对象，但是在语法上很灵活，和一般的面向对象的语言不一样（如java），用户可以选择不显示的使用面向对象的方法，创建类，对象来设计程序，可以只是定义函数（虽然实际上也是对象），来使用类似函数式编程的方式完成程序开发。


#+begin_comment
函数式编程优点：纯函数（不引用类似全局变量的函数，当输入确定时，无论执行多少，结果确定的函数）有明确的输入和输出，能保持输入一致时结果也是一致的，函数是无状态的。所以在网络编程等并发编程场景下，能避免并发竞争和数据一致性问题。和纯函数对应的是有副作用的函数，例如，在很多场景下，会在函数中显示或隐式包含一个上下文参数，保存一切会话状态，函数的行为根据上下文环境有不同的行为和输出结果。

面向对象编程优点：封装数据和行为，重用代码，简化问题（封装，继承，多态）


#+end_comment

