posts/python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing/index.html


<div id="outline-container-orge543668" class="outline-4">
<h4 id="orge543668">函数</h4>
<div class="outline-text-4" id="text-orge543668">
<p>
函数以def定义，python通过空行和缩进来区分函数作用域，函数定义的开始和结束，至少空一行，最好是空两行。语句段落间，推荐空一行，保证程序结构清晰。<br></p>


<div class="highlight"><pre><span></span><span class="c1"># *args 表示可变参数，**kw表示可变的key参数。是处理未知参数的两种扩展参数</span>
<span class="c1"># fname 是普通的站位参数，sname是一个key参数，key参数必须在所有普通参数后面定义，函数调用时同理，但是key参数调用时顺序是可变的</span>
<span class="c1"># 例如： echo("vincent", sname="wang", addr="", 1, 2, 3) 错误</span>
<span class="c1"># echo("vincent",  1, 2, 3, addr="", sname="wang") 正确</span>
<span class="k">def</span> <span class="nf">echo</span><span class="p">(</span><span class="n">fname</span><span class="p">,</span>  <span class="o">*</span><span class="n">args</span><span class="p">,</span> <span class="n">sname</span><span class="o">=</span><span class="s2">""</span><span class="p">,</span> <span class="o">**</span><span class="n">kw</span><span class="p">):</span>
	<span class="nb">print</span><span class="p">(</span><span class="n">fname</span><span class="p">,</span> <span class="n">sname</span><span class="p">,</span> <span class="n">args</span><span class="p">,</span> <span class="n">kw</span><span class="p">)</span>

<span class="n">echo</span><span class="p">(</span><span class="s2">"vincent"</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">3</span><span class="p">,</span> <span class="n">sname</span><span class="o">=</span><span class="s2">"wang"</span><span class="p">,</span> <span class="n">addr</span><span class="o">=</span><span class="s2">""</span><span class="p">)</span>
</pre></div>

<p>
vincent wang (1, 2, 3) {'addr': ''}<br></p>
</div>
</div>

<div id="outline-container-orgfa896e3" class="outline-4">
<h4 id="orgfa896e3">类&amp;对象</h4>
<div class="outline-text-4" id="text-orgfa896e3">
<p>
python类型定义使用class 关键字，创建对象类似于函数调用，只是调用者为类。<br></p>

<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">Student</span><span class="p">(</span><span class="nb">object</span><span class="p">):</span>
    <span class="c1"># 这里定义的定义 会同事定义class和object属性</span>
    <span class="n">fname</span> <span class="o">=</span> <span class="s2">"??"</span>
    <span class="n">sname</span> <span class="o">=</span> <span class="s2">"????"</span>
    <span class="n">age</span> <span class="o">=</span> <span class="mi">12</span>
    <span class="n">addr</span> <span class="o">=</span> <span class="s2">"......"</span>
    <span class="n">phone</span> <span class="o">=</span> <span class="s2">"1000000"</span>

    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">fname</span><span class="p">:</span> <span class="nb">str</span><span class="p">,</span> <span class="n">sname</span><span class="p">:</span> <span class="nb">str</span><span class="p">,</span> <span class="n">age</span><span class="p">:</span> <span class="nb">int</span><span class="p">,</span> <span class="o">**</span><span class="n">kw</span><span class="p">):</span>
	<span class="sd">"""初始化方法"""</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">fname</span> <span class="o">=</span> <span class="n">fname</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">sname</span> <span class="o">=</span> <span class="n">sname</span>
	<span class="c1"># class 属性可以作为默认值</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">age</span> <span class="o">=</span> <span class="n">kw</span><span class="o">.</span><span class="n">get</span><span class="p">(</span><span class="s2">"age"</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">age</span><span class="p">)</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">phone</span> <span class="o">=</span> <span class="n">kw</span><span class="o">.</span><span class="n">get</span><span class="p">(</span><span class="s2">"phone"</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">phone</span><span class="p">)</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">addr</span> <span class="o">=</span> <span class="n">kw</span><span class="o">.</span><span class="n">get</span><span class="p">(</span><span class="s2">"addr"</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">addr</span><span class="p">)</span>
	<span class="c1"># sex只是对象的属性，不是class的属性</span>
	<span class="bp">self</span><span class="o">.</span><span class="n">sex</span> <span class="o">=</span> <span class="n">kw</span><span class="o">.</span><span class="n">get</span><span class="p">(</span><span class="s2">"sex"</span><span class="p">,</span> <span class="mi">0</span><span class="p">)</span>

    <span class="k">def</span> <span class="nf">echo</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="nb">print</span><span class="p">(</span><span class="nb">str</span><span class="p">(</span><span class="bp">self</span><span class="p">))</span>

    <span class="nd">@classmethod</span>
    <span class="k">def</span> <span class="nf">echo_class</span><span class="p">(</span><span class="bp">cls</span><span class="p">):</span>
	<span class="nb">print</span><span class="p">(</span><span class="bp">cls</span><span class="p">,</span> <span class="bp">cls</span><span class="o">.</span><span class="n">fname</span><span class="p">,</span> <span class="bp">cls</span><span class="o">.</span><span class="n">sname</span><span class="p">,</span> <span class="bp">cls</span><span class="o">.</span><span class="n">age</span><span class="p">,</span> <span class="bp">cls</span><span class="o">.</span><span class="n">addr</span><span class="p">,</span> <span class="bp">cls</span><span class="o">.</span><span class="n">phone</span><span class="p">)</span>


    <span class="k">def</span> <span class="fm">__str__</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
	<span class="sd">"""当对象转化成字符串时回调用对象的__str__方法"""</span>
	<span class="k">return</span> <span class="nb">str</span><span class="p">({</span>
	    <span class="s2">"fname"</span><span class="p">:</span> <span class="bp">self</span><span class="o">.</span><span class="n">fname</span><span class="p">,</span>
	    <span class="s2">"sname"</span><span class="p">:</span> <span class="bp">self</span><span class="o">.</span><span class="n">sname</span><span class="p">,</span>
	    <span class="s2">"age"</span><span class="p">:</span> <span class="bp">self</span><span class="o">.</span><span class="n">age</span><span class="p">,</span>
	    <span class="s2">"addr"</span><span class="p">:</span> <span class="bp">self</span><span class="o">.</span><span class="n">addr</span><span class="p">,</span>
	    <span class="s2">"phone"</span><span class="p">:</span> <span class="bp">self</span><span class="o">.</span><span class="n">phone</span><span class="p">,</span>
	    <span class="s2">"sex"</span><span class="p">:</span> <span class="bp">self</span><span class="o">.</span><span class="n">sex</span>
	<span class="p">})</span>


<span class="n">Student</span><span class="o">.</span><span class="n">echo_class</span><span class="p">()</span>

<span class="n">s1</span> <span class="o">=</span> <span class="n">Student</span><span class="p">(</span><span class="s2">"vincent"</span><span class="p">,</span> <span class="s2">"wang"</span><span class="p">,</span> <span class="mi">32</span><span class="p">,</span> <span class="n">sex</span><span class="o">=</span><span class="mi">1</span><span class="p">)</span>

<span class="n">s1</span><span class="o">.</span><span class="n">echo</span><span class="p">()</span>

<span class="n">Student</span><span class="o">.</span><span class="n">addr</span> <span class="o">=</span> <span class="s2">"??????xxxx"</span>
<span class="n">Student</span><span class="o">.</span><span class="n">echo_class</span><span class="p">()</span>

<span class="n">s2</span> <span class="o">=</span> <span class="n">Student</span><span class="p">(</span><span class="s2">"vincent"</span><span class="p">,</span> <span class="s2">"wang"</span><span class="p">,</span> <span class="mi">32</span><span class="p">,</span> <span class="n">sex</span><span class="o">=</span><span class="mi">1</span><span class="p">)</span>

<span class="c1"># 可以看到s2和s1的addr属性是不一致的，原因是对象在初始化前，首先拷贝的类的属性和值</span>
<span class="n">s2</span><span class="o">.</span><span class="n">echo</span><span class="p">()</span>
</pre></div>

<p>
&lt;class '<span class="underline"><span class="underline">__main__</span></span>.Student'&gt; ?? ???? 12 …… 1000000<br>
{'fname': 'vincent', 'sname': 'wang', 'age': 12, 'addr': '……', 'phone': '1000000', 'sex': 1}<br>
&lt;class '<span class="underline"><span class="underline">__main__</span></span>.Student'&gt; ?? ???? 12 ??????xxxx 1000000<br>
{'fname': 'vincent', 'sname': 'wang', 'age': 12, 'addr': '??????xxxx', 'phone': '1000000', 'sex': 1}<br></p>

<p>
其实在python中类也是一种对象，也是可以在运行时动态创建和修改定义的。<br>
新的python规范中所有的类都是继承object这个根类，所以也自带一些内置的函数和方法。如上个例子中的"<span class="underline"><span class="underline">__str__</span></span>"方法。初学者可以稍微浏览一下这些方法，一遍更深入的了解python类和对象的运行机制.<br></p>
</div>
</div>

<div id="outline-container-org5cb788e" class="outline-4">
<h4 id="org5cb788e">注释</h4>
<div class="outline-text-4" id="text-org5cb788e">
<p>
一般单行注释可以使用“#”,多行注释可以使用三个（单、双）引号对包括。<br></p>
</div>
</div>
</div>

<div id="outline-container-org6db2f35" class="outline-2">
<h2 id="org6db2f35">数据类型</h2>
<div class="outline-text-2" id="text-org6db2f35">
</div>
<div id="outline-container-orgffcfc39" class="outline-4">
<h4 id="orgffcfc39">python是面向对象编程的语言,但是也可以像函数式语言工作</h4>
<div class="outline-text-4" id="text-orgffcfc39">
<p>
python 中所有类型都可以看作类、对象。例如所有的函数都是"第一类"的对象，函数有自己的方法，属性，类型，也可以作为任何函数的参数。<br></p>

<p>
如:<br></p>

<div class="highlight"><pre><span></span><span class="c1"># 通过type函数打印print函数类型</span>
<span class="nb">print</span><span class="p">(</span><span class="nb">type</span><span class="p">(</span><span class="nb">print</span><span class="p">))</span>
<span class="c1"># 通过dir函数访问print函数（对象）属性</span>
<span class="nb">print</span><span class="p">(</span><span class="nb">dir</span><span class="p">(</span><span class="nb">print</span><span class="p">))</span>
</pre></div>

<pre class="example">
&lt;class 'builtin_function_or_method'&gt;
['__call__', '__class__', '__delattr__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__name__', '__ne__', '__new__', '__qualname__', '__reduce__', '__reduce_ex__', '__repr__', '__self__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__text_signature__']

</pre>

<p>
可以看到print函数类型是“class 'builtin_function_or_method'”类， 以及它的属性和方法。<br></p>


<p>
虽然python所有类型都是类和对象，但是在语法上很灵活，和一般的面向对象的语言不一样（如java），用户可以选择不显示的使用面向对象的方法，创建类，对象来设计程序，可以只是定义函数（虽然实际上也是对象），来使用类似函数式编程的方式完成程序开发。<br></p>
</div>
</div>
