posts/python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing.org
*** 基本类型
如上文所述，python的基本类型其实也都是类的实例对象，int（整形），string，float， bool等，这点和其他静态语言是有很大不一样的。所以python的基本类型也都有自己丰富的成员函数。

#+BEGIN_SRC ipython :session python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing :exports both :results raw drawer

  a = 1

  print("a 为", type(a), a)

  a = "hello python"

  print("a 为", type(a), a)

  a = 1.0
  print("a 为", type(a), a)

  a = True
  print("a 为", type(a), a)

#+END_SRC

#+RESULTS:
:results:
# Out[15]:
a 为 <class 'int'> 1
a 为 <class 'str'> hello python
a 为 <class 'float'> 1.0
a 为 <class 'bool'> True
:end:

关于一些基本类型的成员方法，可以在官方文档中详细了解[[https://docs.python.org/3/reference/datamodel.html#the-standard-type-hierarchy][python 基本类型分类]]。

*** 复合类型
**** 序列（sequences）
***** 不可修改序列（Immutable）
	  不可修改的序列，意思是类型创建后就不能再次修改。包括：strings（str字符串类型），tuple(元组类型)，bytes（子杰串类型）。注意：只有不可修改的序列才是可以hash化的，也就是可以作为map类型的key值以及set类型的元素。


***** 可修改序列类型（mutable）
	  和不可修改的序列类型对应的的是可修改的序列类型，例如：list（列表类型，相当于数组），bytearray。
	  可修改的序列类型，创建后，可以进行切片操作，任意修改，例如：

#+BEGIN_SRC ipython :session python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing :exports both :results raw drawer

# list

a_list = [1, 2, 3, 4]

a_list.append(5) # 新增元素
# 切片操作
print(a_list, a_list[:-1])

a_list[-1] = a_list[-1]

# tuple元组类型

a_tuple = tuple(a_list)

# 以下操作是错误的
# a_tuple[-1] = a_tuple[-1]

# 序列类型，我们在函数定义中定义缺省参数很多时候会用到
print("*a_tuple=", *a_tuple)

def echo(*args):
  print("echo", args)

echo(a_tuple)
echo("hello", "python")

#+END_SRC

#+RESULTS:
:results:
# Out[20]:
[1, 2, 3, 4, 5] [1, 2, 3, 4]
*a_tuple= 1 2 3 4 5
echo ((1, 2, 3, 4, 5),)
echo ('hello', ' ', 'python')
:end:

**** 集合(set)
	 集合类型保存的是一些无序的Immutable对象，提供了一些集合操作的常用成员函数，如：add(添加元素)，remove（删除元素），intersection（交集）, union（合集）, difference（差集）等操作。

   注意set类型本身是可以修改的，如果想要使用Immutable set类型，可以使用fronzenset。fronzenset创建后不可修改，可以被hash化，也可以作为其它set对象的元素,也可以作为地点类型的key值。


**** 字典（map）

python的map类型，标准库里目前只有字典类型（dict()函数创建，也可以直接使用"{}"赋值）, 字典类型的key值必须是可以hash化的，也就是immutable的。

#+BEGIN_SRC ipython :session python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing :exports both :results raw drawer

a_dict1 = {1:2} # ok

a_dict2 = dict({1:2}) # ok

a_dict3 = dict([tuple([1, 2])]) # ok, 从元组数组转换

print(a_dict1, a_dict2, a_dict3)

#+END_SRC

#+RESULTS:
:results:
# Out[2]:
{1: 2} {1: 2} {1: 2}
:end:


*** 可调用类型（可以像函数一样可以调用的类型） 

**** 用户定义函数

**** 类或者对象的函数

**** 生成器函数（yield）

**** 协程函数

**** 异步生成器函数

**** 内建函数（通常是c语言函数封装而来）


**** 内建成员方法

**** 类构造函数

**** 可调用对象（实现"____call____"函数）

#+BEGIN_SRC ipython :session python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing :exports both :results raw drawer

class CallerObject(object):
  def ____call____(self, *args, **kw):
  """
  可调用对象,必须实现“____call____”成员方法          
  """
    print("hello ", *args, **kw)


caller = CallerObject()

caller("object caller")
#+END_SRC

#+RESULTS:
:results:
# Out[4]:
hello  object caller
:end:

*** 用户定义类型
*** 类的实例化对象

* 简单规范

*** 开始第一个python项目
周边接触到很多使用python的工作的人，不喜欢使用python的工程规范来管理自己的代码，其实这是很不明智的。一个好的习惯是，
将自己的代码用python标准的工程管理起来，这有很多好处，如：

1. 熟练python的setup tools包管理工具， 方便后面使用setup tools一些非常有用的功能
2. 加深理解python环境引用（import）包的一些规则
3. 合理管理程序依赖，发布程序，例如：

  - 使用"python setup.py develop",安装开发环境，实际是生成本地工程的包信息，然后连接到PYTHONPATH中,
 这样如果你改变了你工程代码，不需要任何类似拷贝的操作，在任何地方都可以引用该包,当你的工程是由多个工程或者模块组成的时候这很重要。
  - 使用"python setup.py build",构建的你程序包，验证依赖环境，同时当你想分享你的代码时，其他人可以很方便的安装你的程序（使用“pip install”或者“python setup.py install”）
  - 集成一些必要的功能到你的项目，如：自动化测试，自动安装依赖，自动生成项目文档，发布代码等。

*** 项目样例

   首先可以从github上下载[[https:github.com/navdeep-G/samplemod][python setup 例子github连接]] ，然后在此基础上进行你自己的代码开发。下面将简单介绍里面各个部分的功能，
并以此为基础演示一些有用的技巧。

   首先我们看看这个例子的目录结构：

#+begin_src sh :exports result

ls ../files/python-samplemod
#+end_src

#+RESULTS:
| LICENSE          | 代码法律许可声明，在你需要开放分享你的代码的时候很重要 |
| Makefile         | 使用make来简化一些构建任务                             |
| README.rst       | 本工程说明                                             |
| docs             | 项目文档                                               |
| requirements.txt | 依赖包                                               |
| sample           | 实际代码目录                                           |
| setup.py         | 包管理模需要的setup.py文件                             |
| tests            | 放置的你的测试代码                                        |



然后简单学习一下setup.py 文件编写：

#+include: "../files/python-samplemod/setup.py" src python :minlevel 4

 
