posts/python-ji-chu-yi-ji-chu-yu-fa-he-jie-shi-zhi-xing/index.html

<div id="outline-container-org3e4cab3" class="outline-4">
<h4 id="org3e4cab3">基本类型</h4>
<div class="outline-text-4" id="text-org3e4cab3">
<p>
如上文所述，python的基本类型其实也都是类的实例对象，int（整形），string，float， bool等，这点和其他静态语言是有很大不一样的。所以python的基本类型也都有自己丰富的成员函数。<br></p>

<div class="highlight"><pre><span></span><span class="n">a</span> <span class="o">=</span> <span class="mi">1</span>

<span class="nb">print</span><span class="p">(</span><span class="s2">"a 为"</span><span class="p">,</span> <span class="nb">type</span><span class="p">(</span><span class="n">a</span><span class="p">),</span> <span class="n">a</span><span class="p">)</span>

<span class="n">a</span> <span class="o">=</span> <span class="s2">"hello python"</span>

<span class="nb">print</span><span class="p">(</span><span class="s2">"a 为"</span><span class="p">,</span> <span class="nb">type</span><span class="p">(</span><span class="n">a</span><span class="p">),</span> <span class="n">a</span><span class="p">)</span>

<span class="n">a</span> <span class="o">=</span> <span class="mf">1.0</span>
<span class="nb">print</span><span class="p">(</span><span class="s2">"a 为"</span><span class="p">,</span> <span class="nb">type</span><span class="p">(</span><span class="n">a</span><span class="p">),</span> <span class="n">a</span><span class="p">)</span>

<span class="n">a</span> <span class="o">=</span> <span class="kc">True</span>
<span class="nb">print</span><span class="p">(</span><span class="s2">"a 为"</span><span class="p">,</span> <span class="nb">type</span><span class="p">(</span><span class="n">a</span><span class="p">),</span> <span class="n">a</span><span class="p">)</span>
</pre></div>

<pre class="example">
a 为 &lt;class 'int'&gt; 1
a 为 &lt;class 'str'&gt; hello python
a 为 &lt;class 'float'&gt; 1.0
a 为 &lt;class 'bool'&gt; True

</pre>

<p>
关于一些基本类型的成员方法，可以在官方文档中详细了解<a href="https://docs.python.org/3/reference/datamodel.html#the-standard-type-hierarchy">python 基本类型分类</a>。<br></p>
</div>
</div>

<div id="outline-container-orge95706f" class="outline-4">
<h4 id="orge95706f">复合类型</h4>
<div class="outline-text-4" id="text-orge95706f">
</div>
<ul class="org-ul">
<li>
<a id="org7a3ee63"></a>序列（sequences）<br><ul class="org-ul">
<li>
<a id="orgcf2b82e"></a>不可修改序列（Immutable）<br><div class="outline-text-6" id="text-orgcf2b82e">
<p>
不可修改的序列，意思是类型创建后就不能再次修改。包括：strings（str字符串类型），tuple(元组类型)，bytes（子杰串类型）。注意：只有不可修改的序列才是可以hash化的，也就是可以作为map类型的key值以及set类型的元素。<br></p>
</div>
</li>


<li>
<a id="orgb6887a1"></a>可修改序列类型（mutable）<br><div class="outline-text-6" id="text-orgb6887a1">
<p>
和不可修改的序列类型对应的的是可修改的序列类型，例如：list（列表类型，相当于数组），bytearray。<br>
可修改的序列类型，创建后，可以进行切片操作，任意修改，例如：<br></p>

<div class="highlight"><pre><span></span><span class="c1"># list</span>

<span class="n">a_list</span> <span class="o">=</span> <span class="p">[</span><span class="mi">1</span><span class="p">,</span> <span class="mi">2</span><span class="p">,</span> <span class="mi">3</span><span class="p">,</span> <span class="mi">4</span><span class="p">]</span>

<span class="n">a_list</span><span class="o">.</span><span class="n">append</span><span class="p">(</span><span class="mi">5</span><span class="p">)</span> <span class="c1"># 新增元素</span>
<span class="c1"># 切片操作</span>
<span class="nb">print</span><span class="p">(</span><span class="n">a_list</span><span class="p">,</span> <span class="n">a_list</span><span class="p">[:</span><span class="o">-</span><span class="mi">1</span><span class="p">])</span>

<span class="n">a_list</span><span class="p">[</span><span class="o">-</span><span class="mi">1</span><span class="p">]</span> <span class="o">=</span> <span class="n">a_list</span><span class="p">[</span><span class="o">-</span><span class="mi">1</span><span class="p">]</span>

<span class="c1"># tuple元组类型</span>

<span class="n">a_tuple</span> <span class="o">=</span> <span class="nb">tuple</span><span class="p">(</span><span class="n">a_list</span><span class="p">)</span>

<span class="c1"># 以下操作是错误的</span>
<span class="c1"># a_tuple[-1] = a_tuple[-1]</span>

<span class="c1"># 序列类型，我们在函数定义中定义缺省参数很多时候会用到</span>
<span class="nb">print</span><span class="p">(</span><span class="s2">"*a_tuple="</span><span class="p">,</span> <span class="o">*</span><span class="n">a_tuple</span><span class="p">)</span>

<span class="k">def</span> <span class="nf">echo</span><span class="p">(</span><span class="o">*</span><span class="n">args</span><span class="p">):</span>
  <span class="nb">print</span><span class="p">(</span><span class="s2">"echo"</span><span class="p">,</span> <span class="n">args</span><span class="p">)</span>

<span class="n">echo</span><span class="p">(</span><span class="n">a_tuple</span><span class="p">)</span>
<span class="n">echo</span><span class="p">(</span><span class="s2">"hello"</span><span class="p">,</span> <span class="s2">"python"</span><span class="p">)</span>
</pre></div>

<pre class="example">
[1, 2, 3, 4, 5] [1, 2, 3, 4]
*a_tuple= 1 2 3 4 5
echo ((1, 2, 3, 4, 5),)
echo ('hello', 'python')

</pre>
</div>
</li>
</ul>
</li>

<li>
<a id="org5b4683a"></a>集合(set)<br><div class="outline-text-5" id="text-org5b4683a">
<p>
集合类型保存的是一些无序的Immutable对象，提供了一些集合操作的常用成员函数，如：add(添加元素)，remove（删除元素），intersection（交集）, union（合集）, difference（差集）等操作。<br></p>

<p>
注意set类型本身是可以修改的，如果想要使用Immutable set类型，可以使用fronzenset。fronzenset创建后不可修改，可以被hash化，也可以作为其它set对象的元素,也可以作为地点类型的key值。<br></p>
</div>
</li>


<li>
<a id="orgcbcc58c"></a>字典（map）<br><div class="outline-text-5" id="text-orgcbcc58c">
<p>
python的map类型，标准库里目前只有字典类型（dict()函数创建，也可以直接使用"{}"赋值）, 字典类型的key值必须是可以hash化的，也就是immutable的。<br></p>

<div class="highlight"><pre><span></span><span class="n">a_dict1</span> <span class="o">=</span> <span class="p">{</span><span class="mi">1</span><span class="p">:</span><span class="mi">2</span><span class="p">}</span> <span class="c1"># ok</span>

<span class="n">a_dict2</span> <span class="o">=</span> <span class="nb">dict</span><span class="p">({</span><span class="mi">1</span><span class="p">:</span><span class="mi">2</span><span class="p">})</span> <span class="c1"># ok</span>

<span class="n">a_dict3</span> <span class="o">=</span> <span class="nb">dict</span><span class="p">([</span><span class="nb">tuple</span><span class="p">([</span><span class="mi">1</span><span class="p">,</span> <span class="mi">2</span><span class="p">])])</span> <span class="c1"># ok, 从元组数组转换</span>

<span class="nb">print</span><span class="p">(</span><span class="n">a_dict1</span><span class="p">,</span> <span class="n">a_dict2</span><span class="p">,</span> <span class="n">a_dict3</span><span class="p">)</span>
</pre></div>

<pre class="example">
{1: 2} {1: 2} {1: 2}

</pre>
</div>
</li>
</ul>
</div>


<div id="outline-container-orgab73a1a" class="outline-4">
<h4 id="orgab73a1a">可调用类型（可以像函数一样可以调用的类型）</h4>
<div class="outline-text-4" id="text-orgab73a1a">
</div>
<ul class="org-ul">
<li>
<a id="org1a19b71"></a>用户定义函数<br>
</li>

<li>
<a id="org861cb2b"></a>类或者对象的函数<br>
</li>

<li>
<a id="orgeb109a9"></a>生成器函数（yield）<br>
</li>

<li>
<a id="orgb60b9bd"></a>协程函数<br>
</li>

<li>
<a id="org4b1f2d3"></a>异步生成器函数<br>
</li>

<li>
<a id="org7cf23ba"></a>内建函数（通常是c语言函数封装而来）<br>
</li>


<li>
<a id="org613bb13"></a>内建成员方法<br>
</li>

<li>
<a id="org1f4d12c"></a>类构造函数<br>
</li>

<li>
<a id="org18093c0"></a>可调用对象（实现"<span class="underline"><span class="underline">call</span></span>"函数）<br><div class="outline-text-5" id="text-org18093c0">
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">CallerObject</span><span class="p">(</span><span class="nb">object</span><span class="p">):</span>
	<span class="k">def</span> <span class="fm">__call__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="o">*</span><span class="n">args</span><span class="p">,</span> <span class="o">**</span><span class="n">kw</span><span class="p">):</span>
	    <span class="sd">"""</span>
<span class="sd">	    可调用对象,必须实现“__call__”成员方法          </span>
<span class="sd">	    """</span>
	    <span class="nb">print</span><span class="p">(</span><span class="s2">"hello "</span><span class="p">,</span> <span class="o">*</span><span class="n">args</span><span class="p">,</span> <span class="o">**</span><span class="n">kw</span><span class="p">)</span>


<span class="n">caller</span> <span class="o">=</span> <span class="n">CallerObject</span><span class="p">()</span>

<span class="n">caller</span><span class="p">(</span><span class="s2">"object caller"</span><span class="p">)</span>
</pre></div>

<pre class="example">
hello  object caller

</pre>
</div>
</li>
</ul>
</div>

<div id="outline-container-org5e9c9c7" class="outline-4">
<h4 id="org5e9c9c7">用户定义类型</h4>
</div>
<div id="outline-container-orgac95bf9" class="outline-4">
<h4 id="orgac95bf9">类的实例化对象</h4>
</div>
</div>

<div id="outline-container-orgc87c4e9" class="outline-2">
<h2 id="orgc87c4e9">简单规范</h2>
<div class="outline-text-2" id="text-orgc87c4e9">
</div>
<div id="outline-container-orgbd19a7e" class="outline-4">
<h4 id="orgbd19a7e">开始第一个python项目</h4>
<div class="outline-text-4" id="text-orgbd19a7e">
<p>
周边接触到很多使用python的工作的人，不喜欢使用python的工程规范来管理自己的代码，其实这是很不明智的。一个好的习惯是，<br>
将自己的代码用python标准的工程管理起来，这有很多好处，如：<br></p>

<ol class="org-ol">
<li>熟练python的setup tools包管理工具， 方便后面使用setup tools一些非常有用的功能<br>
</li>
<li>加深理解python环境引用（import）包的一些规则<br>
</li>
<li>
<p>
合理管理程序依赖，发布程序，例如：<br></p>

<ul class="org-ul">
<li>使用"python setup.py develop",安装开发环境，实际是生成本地工程的包信息，然后连接到PYTHONPATH中,<br>
</li>
</ul>
<p>
这样如果你改变了你工程代码，不需要任何类似拷贝的操作，在任何地方都可以引用该包,当你的工程是由多个工程或者模块组成的时候这很重要。<br></p>
<ul class="org-ul">
<li>使用"python setup.py build",构建的你程序包，验证依赖环境，同时当你想分享你的代码时，其他人可以很方便的安装你的程序（使用“pip install”或者“python setup.py install”）<br>
</li>
<li>集成一些必要的功能到你的项目，如：自动化测试，自动安装依赖，自动生成项目文档，发布代码等。<br>
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-org1118d8a" class="outline-4">
<h4 id="org1118d8a">项目样例</h4>
<div class="outline-text-4" id="text-org1118d8a">
<p>
   首先可以从github上下载<a href="https:github.com/navdeep-G/samplemod">python setup 例子github连接</a> ，然后在此基础上进行你自己的代码开发。下面将简单介绍里面各个部分的功能，<br>
并以此为基础演示一些有用的技巧。<br></p>

<p>
首先我们看看这个例子的目录结构：<br></p>

<div class="highlight"><pre><span></span>ls ../files/python-samplemod
</pre></div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">LICENSE</td>
<td class="org-left">代码法律许可声明，在你需要开放分享你的代码的时候很重要</td>
</tr>
<tr>
<td class="org-left">Makefile</td>
<td class="org-left">使用make来简化一些构建任务</td>
</tr>
<tr>
<td class="org-left">README.rst</td>
<td class="org-left">本工程说明</td>
</tr>
<tr>
<td class="org-left">docs</td>
<td class="org-left">项目文档</td>
</tr>
<tr>
<td class="org-left">requirements.txt</td>
<td class="org-left">依赖包</td>
</tr>
<tr>
<td class="org-left">sample</td>
<td class="org-left">实际代码目录</td>
</tr>
<tr>
<td class="org-left">setup.py</td>
<td class="org-left">包管理模需要的setup.py文件</td>
</tr>
<tr>
<td class="org-left">tests</td>
<td class="org-left">放置的你的测试代码</td>
</tr>
</tbody>
</table>
<p>
然后简单学习一下setup.py 文件编写：<br></p>
</div>
</div>
</div>
